## Concat DataFrames

In [6]:
import pandas as pd
kenya_weather=pd.DataFrame({
    "city":["Nairbi","Kisumu","Mombasa"],
    "tmperature":[30,15,60],
    "wind_speed":[6,3,5]
})
kenya_weather

      city  tmperature  wind_speed
0   Nairbi          30           6
1   Kisumu          15           3
2  Mombasa          60           5

In [8]:
tanzania_weather=pd.DataFrame({
    "city":["Moshi","Arusha","Bangamoyo"],
    "tmperature":[10,55,40],
    "wind_speed":[2,5,7]
})
tanzania_weather

        city  tmperature  wind_speed
0      Moshi          10           2
1     Arusha          55           5
2  Bangamoyo          40           7

In [24]:
df=pd.concat([kenya_weather,tanzania_weather])
df

        city  tmperature  wind_speed
0     Nairbi          30           6
1     Kisumu          15           3
2    Mombasa          60           5
0      Moshi          10           2
1     Arusha          55           5
2  Bangamoyo          40           7

## Create a new continus index

In [25]:
df=pd.concat([kenya_weather,tanzania_weather],ignore_index=True)
df

        city  tmperature  wind_speed
0     Nairbi          30           6
1     Kisumu          15           3
2    Mombasa          60           5
3      Moshi          10           2
4     Arusha          55           5
5  Bangamoyo          40           7

## Use Keys for your Data Frames

In [26]:
df=pd.concat([kenya_weather,tanzania_weather],keys=["Kenya","Tanzania"])
df

                 city  tmperature  wind_speed
Kenya    0     Nairbi          30           6
         1     Kisumu          15           3
         2    Mombasa          60           5
Tanzania 0      Moshi          10           2
         1     Arusha          55           5
         2  Bangamoyo          40           7

In [29]:
df.loc["Kenya"]

      city  tmperature  wind_speed
0   Nairbi          30           6
1   Kisumu          15           3
2  Mombasa          60           5

In [30]:
df.loc["Tanzania"]

        city  tmperature  wind_speed
0      Moshi          10           2
1     Arusha          55           5
2  Bangamoyo          40           7

In [31]:
uganda_weather=pd.DataFrame({
    "city":["Kampala","Tororo","Njija"],
    "tmperature":[10,55,40]

})
uganda_weather

      city  tmperature
0  Kampala          10
1   Tororo          55
2    Njija          40

In [33]:
uganda_windspeed=pd.DataFrame({
    "city":["Kampala","Tororo","Njija"],
    "windspeed":[10,55,40]

})
uganda_windspeed

      city  windspeed
0  Kampala         10
1   Tororo         55
2    Njija         40

## Horizontal Concat - axis=1

In [37]:
df=pd.concat([uganda_weather,uganda_windspeed],axis=1)
df

      city  windspeed     city  windspeed
0  Kampala         10  Kampala         10
1   Tororo         55   Tororo         55
2    Njija         40    Njija         40

## Use of index to align columns with missing data

In [39]:
#Specify index
uganda_weather=pd.DataFrame({
    "city":["Kampala","Tororo","Njija"],
    "tmperature":[10,55,40]

},index=(0,1,2))
uganda_weather

      city  tmperature
0  Kampala          10
1   Tororo          55
2    Njija          40

In [41]:
#Missing and disorginsed data
uganda_windspeed=pd.DataFrame({
    "city":["Tororo","Kampala"],
    "windspeed":[10,55]

},index=(1,0))
uganda_windspeed

      city  windspeed
1   Tororo         10
0  Kampala         55

In [43]:
#use of index as defined above
df=pd.concat([uganda_weather,uganda_windspeed],axis=1)
df

      city  tmperature     city  windspeed
0  Kampala          10  Kampala       55.0
1   Tororo          55   Tororo       10.0
2    Njija          40      NaN        NaN

# Append a Series to a DataFrame

In [44]:
uganda_weather=pd.DataFrame({
    "city":["Kampala","Tororo","Njija"],
    "tmperature":[10,55,40]

})
uganda_weather

      city  tmperature
0  Kampala          10
1   Tororo          55
2    Njija          40

In [53]:
event=pd.Series(["rain","thunder","sunny"],name="event")
event

0       rain
1    thunder
2      sunny
Name: event, dtype: object

In [55]:
pd.concat([uganda_weather,event],axis=1)

      city  tmperature    event
0  Kampala          10     rain
1   Tororo          55  thunder
2    Njija          40    sunny